In [1]:
import numpy as np
import pandas as pd

In [2]:
df = pd.read_csv('result.csv')

In [10]:
df.head()

,Unnamed: 0,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [24]:
# Average Price regarding Sex

sex_fare = df[['Sex', 'Fare']].groupby(['Sex']).mean()  # the col(s) in groupby() automatically become(s) the new index
sex_fare

             Fare
Sex
female  44.479818
male    25.523893

In [25]:
sex_survived = df[['Sex', 'Survived']].groupby(['Sex']).sum()
sex_survived

        Survived
Sex
female       233
male         109

In [12]:
df[['Pclass', 'Survived']].groupby(['Pclass']).sum()

        Survived
Pclass
1            136
2             87
3            119

In [ ]:
#  Female survived more than male passengers. It might be a result of more women in higher class.

In [22]:
df[df['Sex']== 'female']['Fare'].agg('mean')

44.47981783439487

In [23]:
df[df['Sex']== 'male']['Fare'].agg('mean')

25.523893414211418

In [48]:
# Or better

df.groupby('Sex').agg({'Fare': 'mean', 'Pclass': 'count'}).rename(columns=
                        {'Fare': 'mean_fare', 'Pclass': 'count_pclass'})

        mean_fare  count_pclass
Sex
female  44.479818           314
male    25.523893           577

In [30]:
sex_fare_survived = sex_fare.join(sex_survived)
sex_fare_survived.to_csv('sex_fare_survived.csv')

In [50]:
df.groupby(['Pclass','Age'])['Fare'].mean()

Pclass  Age
1       0.92     151.5500
        2.00     151.5500
        4.00      81.8583
        11.00    120.0000
        14.00    120.0000
                   ...
3       61.00      6.2375
        63.00      9.5875
        65.00      7.7500
        70.50      7.7500
        74.00      7.7750
Name: Fare, Length: 182, dtype: float64

In [43]:
df_age_survived = df[['Age', 'Survived']].groupby(['Age']).sum()
df_age_survived.sort_values(by = 'Survived', ascending = False)

      Survived
Age
24.0        15
22.0        11
27.0        11
36.0        11
35.0        11
...        ...
20.5         0
23.5         0
24.5         0
28.5         0
40.5         0

[88 rows x 1 columns]

In [45]:
df[df['Age'] == 24.0].shape

(30, 13)

In [ ]:
# highest survival rate = 15/30 = 0.5